{
  "NFLDraft":
  [
    {"PlayerName":"Kyle Hamilton","PlayerDescription":"High-impact safety with unique blend of traits and characteristics that make him a bit of a unicorn at the position. Hamilton has the eyes and speed to play over the top, the strength and toughness to play near the line, and coverage length to guard elite pass-catching tight ends who often mismatch opposing defenses. It's rare to find such a ferocious striker and intimidator who has the football intelligence and athletic prowess to go make plays in the passing game, but Hamilton provides it all.","PlayerID":1,"PlayerPosition":"Safety","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Notre Dame","PlayerAge":"21","PlayerHeight":"6'4","PlayerWeight":"220 lbs", "PlayerProfile": ""},
    {"PlayerName":"Aidan Hutchinson","PlayerDescription":"Defensive end prospect with a can't-miss combination of football character, skill and physical traits who is more likely to contend for occasional Pro Bowls than become an All-Pro playmaker. Hutchinson's strength and flexion allows him to drop a deep anchor and set a very firm edge, and that is unlikely to change as a pro whether he's used in 4-3 or 3-4 fronts. He can be too mechanical, engaging in cursory contact rather than using his hands to whip the man in front of him quickly.","PlayerID":2,"PlayerPosition":"Defensive End","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Michigan","PlayerAge":"21","PlayerHeight":"6'7","PlayerWeight":"260 lbs", "PlayerProfile": ""},
    {"PlayerName":"Evan Neal","PlayerDescription":"Three-year starter with rare combination of measurables, talent and pedigree. Neal has experience against the best competition the college game has to offer. He has started at both left and right tackle and should project on the left side if he can continue to manage his weight. While he has flashes of greatness on tape, he doesn't always maintain that level throughout a game. Intensity and consistency are two areas that will be key in matching performance with profile.","PlayerID":3,"PlayerPosition":"O Tackle","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Alabama","PlayerAge":"21","PlayerHeight":"6'7 1/2","PlayerWeight":"337 lbs", "PlayerProfile": ""},
    {"PlayerName":"Ikem (Ickey) Ekwonu","PlayerDescription":"A gentleman in class and killer on the grass, Ekwonu goes from amiable to angry once he steps foot on the field. He's a long-limbed athlete and scheme-diverse run blocker with the potential to win with positioning or force. He has a highlight reel full of violent strikes and finishes but needs to cut his aggression with a little more control. The pass protection has seen rough patches over the last two years and that might continue until his hands and feet start working in unison. Punch timing and independent hands should bring immediate improvement, but getting him to play with better focus and control in his pass sets will take time.","PlayerID":4,"PlayerPosition":"O Tackle","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"N.C. State","PlayerAge":"22","PlayerHeight":"6'4","PlayerWeight":"310 lbs", "PlayerProfile": ""},
    {"PlayerName":"Kayvon Thibodeaux","PlayerDescription":"Enticing edge defender whose game is fueled by traits and power over skill and instincts at this juncture of his career. Thibodeaux is hardly a finished product, but has pro-ready attributes that should help him acclimate quickly. He's a plus run defender who punches above his weight at the point of attack with heavy hands and a sturdy base. He has some suddenness in tight quarters and above-average pursuit speed, which should keep the tackles for loss rolling in throughout his career. Thibodeaux rushes with effort, upfield burst and play-through power that should bring reasonable sack/pressure production.","PlayerID":5,"PlayerPosition":"Edge Rusher","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Oregon","PlayerAge":"21","PlayerHeight":"6'4","PlayerWeight":"254 lbs", "PlayerProfile": ""},
    {"PlayerName":"Sauce Gardner","PlayerDescription":"Long, lean and linear, Gardner's physical and football growth are on full display when comparing his 2019 tape to 2021. He's highly competitive with a confidence level that will be labeled as cocky by some evaluators. Sauce uses length and hand activity to impose his will on the release and stall the route on the tarmac. Staying connected to the route is a priority, which leads to grabbing when he feels it slipping away but that can be corrected by improving his footwork and trusting his technique. His movements lack fluidity, but he's urgent and aggravating in man-to-man, which could become a deterrent for NFL quarterbacks scanning to his side of the field if he can avoid a big spike in penalties as he adjusts to NFL officiating.","PlayerID":6,"PlayerPosition":"Cornerback","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Cincinnati","PlayerAge":"21","PlayerHeight":"6'3","PlayerWeight":"190 lbs", "PlayerProfile": ""},
    {"PlayerName":"Malik Willis","PlayerDescription":"Upside quarterback with special parts of his game, but with no guarantee they will be assembled properly into a finished product. Willis uses his rare combination of elite rushing talent and a rocket-launching right arm to unlock explosive plays in two different ways. He has the arm to beat safeties to the deepest parts of the field and makes impressive throws from inside and outside the pocket. On the flip side, Willis' mechanical and operational inconsistencies lead to erratic timing and accuracy, and he doesn't throw with enough touch. Protection and receiver separation were both issues, but Willis also pressed over the second half of the season and never looked comfortable in the Liberty offense.","PlayerID":7,"PlayerPosition":"Quarterback","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Liberty","PlayerAge":"22","PlayerHeight":"6'0 1/2","PlayerWeight":"219 lbs", "PlayerProfile": ""},
    {"PlayerName":"Garrett Wilson","PlayerDescription":"Wilson's game is lacking in polish, but some scouts believe his play strength and run-after-catch ability make him a more valuable draft commodity than Ohio State teammate Chris Olave. He's a linear, inside/outside receiver with trouble eluding press cleanly and is very inefficient with routes over the first two levels. His long speed is good, but the acceleration burst is what makes him such an effective separator in space. He might not be smooth getting there, but he has eye-popping ball skills when it's time to go make a play.","PlayerID":8,"PlayerPosition":"Wide Receiver","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Ohio State","PlayerAge":"21","PlayerHeight":"6'0","PlayerWeight":"183 lbs", "PlayerProfile": ""},
    {"PlayerName":"Kenny Pickett","PlayerDescription":"Pickett has five years of game experience and four years of starting experience for Pitt. He's a fairly toolsy pocket passer with good mobility. He operated in a passing scheme featuring vertical concepts that created big-play opportunities but left food on the plate when he failed to play chess against the back-end of the coverage. Pickett works with average anticipation but drives the ball with good velocity, which should help him shine in pre-draft passing drills. Pickett's touch and placement need work, but his accuracy stats were damaged by an inordinate amount of drops throughout his career. The top indicator for future success or failure will likely rest in a team's ability to build Pickett's trust, poise and discipline from the pocket.","PlayerID":9,"PlayerPosition":"Quarterback","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Pittsburgh","PlayerAge":"23","PlayerHeight":"6'3","PlayerWeight":"217 lbs", "PlayerProfile": ""},
    {"PlayerName":"Derek Stingley Jr.","PlayerDescription":"Uniquely gifted cornerback with rare blend of size, speed and explosiveness that will have teams willing to judge his upside off of tape from two seasons ago. Stingley played in just 10 games over the last two years, offering flashes of his upside rather than sustained play. Regardless of season, he's long, loose and extremely athletic. Elite speed and ball skills give him a chance to thrive as a bump-and-run corner capable of shadowing top talent around the field. He allows some separation from off-man but bursts to close distance instantly. He's well-suited for a variety of zone coverages but needs to play with much better zeal and toughness in run support.","PlayerID":10,"PlayerPosition":"Cornerback","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"LSU","PlayerAge":"20","PlayerHeight":"6'0","PlayerWeight":"190 lbs", "PlayerProfile": ""},
    {"PlayerName":"Jameson Williams","PlayerDescription":"Linear route-runner with electric long speed to impact a game as a home-run hitter or decoy drawing defenders away from other elements of the offense. Williams ruins man coverage but faces some limitations. He has issues getting off press cleanly and might require some scheming to help get off the mark cleanly against certain corners. Catch toughness can be inconsistent when contested or in heavily trafficked areas. He has all the juice to find consistent separation on vertical, over and post/corner routes and could see monstrous production if paired with a high-end talent at quarterback.","PlayerID":11,"PlayerPosition":"Wide Receiver","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Alabama","PlayerAge":"21","PlayerHeight":"6'1 1/2","PlayerWeight":"179 lbs", "PlayerProfile": ""},
    {"PlayerName":"Tyler Linderbaum","PlayerDescription":"Linderbaum has Pro Bowl potential but needs to be matched with a move-based rushing attack. He has the foot quickness and GPS to consistently find top positioning in the first phase of the block. He plays with leverage and body control to sustain and keep the running lane open. However, his size will make block finishing somewhat hit or miss and he will need help against some of the bigger defenders lining up across from him. Teams with certain size standards might pass on him but his tenacity and talent make him a can't-miss prospect if matched in the right scheme.","PlayerID":12,"PlayerPosition":"Center","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Iowa","PlayerAge":"21","PlayerHeight":"6'2","PlayerWeight":"296 lbs", "PlayerProfile": ""},
    {"PlayerName":"Jordan Davis","PlayerDescription":"Beefy, mountainous nose tackle with the size, power and will to clog the drain and alter the offense's desire to run between the tackles. Davis has anchor and quick-shed talent to eviscerate single blocks and successfully occupy double teams, allowing linebackers to thrive in pursuit of ball-carriers. He plays upright, lacking agility and reactive quickness to mark up a stat sheet with any consistency, but that's not what he's asked to do. Davis won't be as effective against outside-zone teams and won't offer much rush, but he could become one of the league's best run-pluggers as soon as he takes the field.","PlayerID":13,"PlayerPosition":"D Tackle","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Georgia","PlayerAge":"22","PlayerHeight":"6'6","PlayerWeight":"341 lbs", "PlayerProfile": ""},
    {"PlayerName":"Travon Walker","PlayerDescription":"Walker is a big, rugged run-stopper with the playing style and body type to play 3-4 end. He consistently outreaches blockers and takes control at the point of attack, and sets firm edges despite playing with limited knee-bend. He plays with violent hands, sluggish feet and all-day aggressiveness. He has quick-shed ability to make plays near his gaps but lacks lateral quickness to play with desired range. He won't be considered a skilled or threatening rusher from any alignment but can plow his way forward to find occasional success.","PlayerID":14,"PlayerPosition":"Defensive End","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Georgia","PlayerAge":"21","PlayerHeight":"6'5","PlayerWeight":"272 lbs", "PlayerProfile": ""},
    {"PlayerName":"Breece Hall","PlayerDescription":"Will give NFL evaluators early starter vibes with his blend of size, power and creativity. Hall isn't very sudden in tight quarters but gets better as the run play progresses with good vision and an above-average sense for how to beat second-level tacklers. He has surprising build-up speed once he's in the open field but might not have the instant gas to become a plus outside runner. His running style is willful when it needs to be and he's adept at moving the chains on got to have it short-yardage carries. Hall has full-package, three-down talent with surprisingly soft hands out of the backfield and should find early touches as a Day 2 draft pick with above-average potential.","PlayerID":15,"PlayerPosition":"Running Back","PlayerImage":"https://raw.githubusercontent.com/donalmeida/JSONProjectsIT315/master/oldrag.jpg","PlayerCollege":"Iowa State","PlayerAge":"20","PlayerHeight":"5'11","PlayerWeight":"217 lbs", "PlayerProfile": ""}
  ],
  "Status":"OK"
}
